app/controllers/employee_controller.rb

  def profile

    @current_user = current_user
    @employee = Employee.find(params[:id])
    @new_reminder_count = Reminder.find_all_by_recipient(@current_user.id, :conditions=>"is_read = false")
---
SELECT * FROM `employees` WHERE (`employees`.user_id = 1) LIMIT 1
SELECT * FROM `reminders` WHERE (is_read = false) AND (`reminders`.`recipient` = 1)

  def profile_pdf
    @employee = Employee.find(params[:id])
    @gender = "Male"
    @gender = "Female" if @employee.gender == false
    @status = "Active"
    @status = "Inactive" if @employee.status == false
    @reporting_manager = Employee.find(@employee.reporting_manager_id).first_name unless @employee.reporting_manager_id.nil?
    exp_years = @employee.experience_year
    exp_months = @employee.experience_month
    date = Date.today
    total_current_exp_days = (date-@employee.joining_date).to_i
    current_years = total_current_exp_days/365
    rem = total_current_exp_days%365
    current_months = rem/30
    total_month = current_months if exp_months.nil?
    total_month = exp_months+current_months unless exp_months.nil?
    year = total_month/12
    month = total_month%12
    @total_years = current_years+year if exp_years.nil?
    @total_years = exp_years+current_years+year unless exp_years.nil?
    @total_months = month
    @home_country = Country.find(@employee.home_country_id).name unless @employee.home_country_id.nil?
    @office_country = Country.find(@employee.office_country_id).name unless @employee.office_country_id.nil?
    @bank_details = EmployeeBankDetail.find_all_by_employee_id(@employee.id)
    @additional_details = EmployeeAdditionalDetail.find_all_by_employee_id(@employee.id)
---
SELECT * FROM `employees` WHERE (`employees`.user_id = 1) LIMIT 1
SELECT * FROM `countries` WHERE (`countries`.`id` = 76)
SELECT * FROM `employee_bank_details` WHERE (`employee_bank_details`.`employee_id` = 1)
SELECT * FROM `employee_additional_details` WHERE (`employee_additional_details`.`employee_id` = 1)