app/controllers/user_controller.rb

  def dashboard
    @subdomain = SubDomain.find_by_name(current_subdomain)
    @user = current_user
    @config = Configuration.available_modules
    @employee = @user.employee_record if ['employee', 'admin'].include?(@user.role_name.downcase)
    if @user.student?
      @student = Student.find_by_admission_no(@user.username)
---
SELECT * FROM `employees` WHERE (`employees`.user_id = 1) LIMIT 1
SELECT * FROM `students` WHERE (`students`.`admission_no` = 'admin') LIMIT 1

  def login
    @institute = Configuration.find_by_config_key("LogoName")
    available_login_authes = FedenaPlugin::AVAILABLE_MODULES.select { |m| m[:name].classify.constantize.respond_to?("login_hook") }
    selected_login_hook = available_login_authes.first if available_login_authes.count>=1
    if selected_login_hook
      authenticated_user = selected_login_hook[:name].classify.constantize.send("login_hook", self)
    else
      if request.post? and params[:user]
        @user = User.new(params[:user])
        user = User.find_by_username @user.username
        if user.present? and User.authenticate?(@user.username, @user.password)
---
SELECT * FROM `configurations` WHERE (`configurations`.`config_key` = 'AvailableModules')
SELECT `users`.id FROM `users` WHERE (`users`.`username` = BINARY 'admin' AND `users`.id <> 1) LIMIT 1
SELECT * FROM `users` INNER JOIN `privileges_users` ON `users`.id = `privileges_users`.user_id WHERE (`privileges_users`.privilege_id = 21 )

  def profile
    @config = Configuration.available_modules
    @current_user = current_user
    @username = @current_user.username if session[:user_id]
    @user = User.find_by_username(params[:id])
    unless @user.nil?
      @employee = Employee.find_by_employee_number(@user.username)
      @student = Student.find_by_admission_no(@user.username)
---
SELECT * FROM `users` WHERE (`users`.`username` = 'admin') LIMIT 1
SELECT * FROM `employees` WHERE (`employees`.`employee_number` = 'admin') LIMIT 1
SELECT * FROM `students` WHERE (`students`.`admission_no` = 'admin') LIMIT 1

  def set_new_password
    if request.post?
      user = User.find_by_reset_password_code(params[:id], :conditions => "reset_password_code IS NOT NULL")
      if user
        if params[:set_new_password][:new_password] === params[:set_new_password][:confirm_password]
          user.password = params[:set_new_password][:new_password]
          user.update_attributes(:password => user.password, :reset_password_code => nil, :reset_password_code_until => nil, :role => user.role_name)
---
UPDATE `users` SET `employee` = 0, `admin` = 1, `updated_at` = '2014-02-20 18:18:19' WHERE `id` = 1

  def header_link
    @user = current_user
    #@reminders = @users.check_reminders
    @config = Configuration.available_modules
    @employee = Employee.find_by_employee_number(@user.username)
    @employee ||= Employee.first if current_user.admin?
    @student = Student.find_by_admission_no(@user.username)
---
SELECT * FROM `employees` WHERE (`employees`.`employee_number` = 'admin') LIMIT 1
SELECT * FROM `students` WHERE (`students`.`admission_no` = 'admin') LIMIT 1